# Thanks to @jasonrudolph for introducing me to Brewfile
#
# To use, first ensure that homebrew-bundle is installed:
#
#   brew tap Homebrew/bundle
#
# Then, run `brew bundle`:
#
# brew bundle --file=<path-to-Brewfile>

tap "caskroom/cask"
tap "homebrew/bundle"

brew "bash-completion"
brew "ctags"
brew "fzf"
brew "git"
brew "node"
brew "reattach-to-user-namespace"
brew "the_silver_searcher"
brew "tmux"
brew "vim"
brew "wget"
brew "yarn"

cask "docker"
cask "firefox"
cask "google-chrome"
cask "iterm2"
cask "zoomus"
