# Thanks to @jasonrudolph for introducing me to Brewfile
#
# To use, first ensure that homebrew-bundle is installed:
#
#   brew tap Homebrew/bundle
#
# Then, run `brew bundle`:
#
# brew bundle --file=<path-to-Brewfile>

tap "homebrew/cask"
tap "homebrew/bundle"

brew "bash"
brew "bash-completion"
brew "bat"
brew "ctags"
brew "elm"
brew "fzf"
brew "gh"
brew "git"
brew "gnupg"
brew "htop"
brew "jq"
brew "node"
brew "nvm"
brew "postgresql"
brew "rbenv"
brew "shellcheck"
brew "the_silver_searcher"
brew "tmate"
brew "tmux"
brew "vim"
brew "wget"
brew "yarn"

cask "1password"
cask "docker"
cask "firefox"
cask "hammerspoon"
cask "licecap"
cask "iterm2"
cask "karabiner-elements"
cask "muzzle"
cask "raycast"
cask "zoom"
