# Thanks to @jasonrudolph for introducing me to Brewfile
#
# To use, first ensure that homebrew-bundle is installed:
#
#   brew tap Homebrew/bundle
#
# Then, run `brew bundle`:
#
# brew bundle --file=<path-to-Brewfile>

tap "homebrew/cask"
tap "homebrew/bundle"

brew "bash"
brew "bash-completion@2"
brew "bat"
brew "ctags"
brew "elm" if OS.mac?
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "gnupg"
brew "htop"
brew "jq"
brew "node"
brew "nvm"
brew "postgresql" if OS.mac?
brew "rbenv"
brew "shellcheck"
brew "the_silver_searcher"
brew "tmux"
brew "vim"
brew "wget"
brew "yarn"

cask "1password" if OS.mac?
cask "docker" if OS.mac?
cask "firefox" if OS.mac?
cask "hammerspoon" if OS.mac?
cask "licecap" if OS.mac?
cask "iterm2" if OS.mac?
cask "karabiner-elements" if OS.mac?
cask "raycast" if OS.mac?
cask "zoom" if OS.mac?
